iarsystems/ewarm-toshiba-example-projects/TMPM311/CMSIS/Device/Toshiba/TMPM310/Include/TMPM311.h
/**
 *******************************************************************************
 * @file    TMPM311.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM311' Device Series
 * @version V2.0.2.1 (Tentative)
 * @date    2014/09/05
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2014 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM311
  * @{
  */

#ifndef __TMPM311_H__
#define __TMPM311_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM311 Specific Interrupt Numbers *******************************************************************/
  INTDSADA_IRQn                 = 0,         /*!< DSAD conversion complete interrupt (unitA)                  */
  INTDSADB_IRQn                 = 1,         /*!< DSAD conversion complete interrupt (unitB)                  */
  INTDSADC_IRQn                 = 2,         /*!< DSAD conversion complete interrupt (unitC)                  */
  INTDSADD_IRQn                 = 3,         /*!< DSAD conversion complete interrupt (unitD)                  */
  INT0_IRQn                     = 4,         /*!< Interrupt pin 0                                             */
  INT1_IRQn                     = 5,         /*!< Interrupt pin 1                                             */
  INTSSP0_IRQn                  = 6,         /*!< SSP0 interrupt                                              */
  INTRX0_IRQn                   = 7,         /*!< Serial0 reception interrupt                                 */
  INTTX0_IRQn                   = 8,         /*!< Serial0 transmission interrupt                              */
  INTTB0_IRQn                   = 9,         /*!< 16-bit TMRB0 compare match detection interrupt              */
  INTTB1_IRQn                   = 10,        /*!< 16-bit TMRB1 compare match detection interrupt              */
  INTTB2_IRQn                   = 11,        /*!< 16-bit TMRB2 compare match detection interrupt              */
  INTTB3_IRQn                   = 12,        /*!< 16-bit TMRB3 compare match detection interrupt              */
  INTCAP00_IRQn                 = 13,        /*!< 16-bit TMRB0 input capture 0 detection interrupt            */
  INTCAP01_IRQn                 = 14,        /*!< 16-bit TMRB0 input capture 1 detection interrupt            */
  INTCAP10_IRQn                 = 15,        /*!< 16-bit TMRB1 input capture 0 detection interrupt            */
  INTCAP11_IRQn                 = 16,        /*!< 16-bit TMRB1 input capture 1 detection interrupt            */
  INTT16A0_IRQn                 = 17,        /*!< 16-bit TMR16A0 match detection                              */
  INTDMAATC0_IRQn               = 18,        /*!< DMAC 0 transmission completion interrupt (unitA)            */
  INTDMAATC1_IRQn               = 19,        /*!< DMAC 1 transmission completion interrupt (unitA)            */
  INTDMAATC2_IRQn               = 20,        /*!< DMAC 2 transmission completion interrupt (unitA)            */
  INTDMAATC3_IRQn               = 21,        /*!< DMAC 3 transmission completion interrupt (unitA)            */
  INTDMAAERR_IRQn               = 22         /*!< DMAC transmissioni error interrupt (unitA)                  */
} IRQn_Type;

/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0201       /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
#include "system_TMPM311.h"                 /* TMPM311 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief Synchronous Serial Port (SSP)
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< SSP Control Register 0                       */
  __IO uint32_t CR1;               /*!< SSP Control Register 1                       */
  __IO uint32_t DR;                /*!< SSP Data Register                            */
  __I  uint32_t SR;                /*!< SSP Status Register                          */
  __IO uint32_t CPSR;              /*!< SSP Clock Prescaler Register                 */
  __IO uint32_t IMSC;              /*!< SSP Interrupt Mask Set and Clear Register    */
  __I  uint32_t RIS;               /*!< SSP Raw Interrupt Status Register            */
  __I  uint32_t MIS;               /*!< SSP Masked Interrupt Status Register         */
  __O  uint32_t ICR;               /*!< SSP Interrupt Clear Register                 */
} TSB_SSP_TypeDef;

/**
  * @brief DMA Controller (DMA)
  */
typedef struct
{
  __I  uint32_t STATUS;            /*!< DMA Status Register                          */
  __O  uint32_t CFG;               /*!< DMA Configuration Register                   */
  __IO uint32_t CTRLBASEPTR;       /*!< DMA Control Data Base Pointer Register       */
  __I  uint32_t ALTCTRLBASEPTR;    /*!< DMA Channel Alternate Control Data Base Pointer Register*/
       uint32_t RESERVED0;
  __O  uint32_t CHNLSWREQUEST;     /*!< DMA Channel Software Request Register        */
  __IO uint32_t CHNLUSEBURSTSET;   /*!< DMA Channel Useburst Set Register            */
  __O  uint32_t CHNLUSEBURSTCLR;   /*!< DMA Channel Useburst Clear Register          */
  __IO uint32_t CHNLREQMASKSET;    /*!< DMA Channel Request Mask Set Register        */
  __O  uint32_t CHNLREQMASKCLR;    /*!< DMA Channel Request Mask Clear Register      */
  __IO uint32_t CHNLENABLESET;     /*!< DMA Channel Enable Set Register              */
  __O  uint32_t CHNLENABLECLR;     /*!< DMA Channel Enable Clear Register            */
  __IO uint32_t CHNLPRIALTSET;     /*!< DMA Channel Primary-Alternate Set Register   */
  __O  uint32_t CHNLPRIALTCLR;     /*!< DMA Channel Primary-Alternate Clear Register */
  __IO uint32_t CHNLPRIORITYSET;   /*!< DMA Channel Priority Set Register            */
  __O  uint32_t CHNLPRIORITYCLR;   /*!< DMA Channel Priority Clear Register          */
       uint32_t RESERVED1[3];
  __IO uint32_t ERRCLR;            /*!< DMA Bus Error Clear Register                 */
} TSB_DMA_TypeDef;

/**
  * @brief Temperature Sensor (TEMP)
  */
typedef struct
{
  __IO uint32_t EN;                /*!< Enable Register                              */
  __IO uint32_t CR;                /*!< Control Register                             */
} TSB_TEMP_TypeDef;

/**
  * @brief 24bit Delta Sigma AD Converter (DSAD)
  */
typedef struct
{
  __IO uint32_t CLK;               /*!< Conversion Clock Setting Register            */
  __IO uint32_t CR0;               /*!< Control Register 0                           */
  __IO uint32_t CR1;               /*!< Control Register 1                           */
  __IO uint32_t CR2;               /*!< Control Register 2                           */
  __IO uint32_t CR3;               /*!< Control Register 3                           */
  __IO uint32_t CR4;               /*!< Control Register 4                           */
  __IO uint32_t CR5;               /*!< Control Register 5                           */
       uint32_t RESERVED0[5];
  __IO uint32_t ADJ;               /*!< Adjust Register                              */
       uint32_t RESERVED1[3];
  __I  uint32_t ST;                /*!< Status Register                              */
  __I  uint32_t RES;               /*!< Result Register                              */
} TSB_DSAD_TypeDef;

/**
  * @brief 16-bit TimerA (T16A)
  */
typedef struct
{
  __IO uint32_t EN;                /*!< Enable Register                              */
  __IO uint32_t RUN;               /*!< RUN Register                                 */
  __IO uint32_t CR;                /*!< Control Register                             */
  __IO uint32_t RG;                /*!< Timer Register                               */
  __I  uint32_t CP;                /*!< Capture Register                             */
} TSB_T16A_TypeDef;

/**
  * @brief Interrupt Controller (INT)
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< Control Register 0                           */
  __IO uint32_t CR1;               /*!< Control Register 1                           */
       uint32_t RESERVED0[15];
  __O  uint32_t CLR;               /*!< Interrupt Request Clear Register             */
  __IO uint32_t RESETF;            /*!< Reset Flag Register                          */
} TSB_INT_TypeDef;

/**
  * @brief Port A (PA)
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Data Register                                */
  __IO uint32_t CR;                /*!< Output Control Register                      */
  __IO uint32_t FR1;               /*!< Function Register 1                          */
       uint32_t RESERVED0[8];
  __IO uint32_t PUP;               /*!< Pull-up Control Register                     */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                /*!< Input Control Register                       */
} TSB_PA_TypeDef;

/**
  * @brief Port B (PB)
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Data Register                                */
  __IO uint32_t CR;                /*!< Output Control Register                      */
  __IO uint32_t FR1;               /*!< Function Register 1                          */
       uint32_t RESERVED0[8];
  __IO uint32_t PUP;               /*!< Pull-up Control Register                     */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                /*!< Input Control Register                       */
} TSB_PB_TypeDef;

/**
  * @brief Port C (PC)
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Data Register                                */
  __IO uint32_t CR;                /*!< Output Control Register                      */
  __IO uint32_t FR1;               /*!< Function Register 1                          */
       uint32_t RESERVED0[8];
  __IO uint32_t PUP;               /*!< Pull-up Control Register                     */
  __IO uint32_t PDN;               /*!< Pull-down Control Register                   */
       uint32_t RESERVED1;
  __IO uint32_t IE;                /*!< Input Control Register                       */
} TSB_PC_TypeDef;

/**
  * @brief Port D (PD)
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Data Register                                */
  __IO uint32_t CR;                /*!< Output Control Register                      */
       uint32_t RESERVED0[9];
  __IO uint32_t PUP;               /*!< Pull-up Control Register                     */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                /*!< Input Control Register                       */
} TSB_PD_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t EN;                /*!< Enable Register                              */
  __IO uint32_t RUN;               /*!< RUN Register                                 */
  __IO uint32_t CR;                /*!< Control Register                             */
  __IO uint32_t MOD;               /*!< Mode Register                                */
  __IO uint32_t FFCR;              /*!< Flip-Flop Control Register                   */
  __I  uint32_t ST;                /*!< Status Register                              */
  __IO uint32_t IM;                /*!< Interrupt Mask Register                      */
  __I  uint32_t UC;                /*!< Up-counter Capture Register                  */
  __IO uint32_t RG0;               /*!< RG0 Timer Register                           */
  __IO uint32_t RG1;               /*!< RG1 Timer Register                           */
  __I  uint32_t CP0;               /*!< CP0 Capture Register                         */
  __I  uint32_t CP1;               /*!< CP1 Capture Register                         */
} TSB_TB_TypeDef;

/**
  * @brief SIO/UART (SC)
  */
typedef struct
{
  __IO uint32_t EN;                /*!< Enable Register                              */
  __IO uint32_t BUF;               /*!< Buffer Register                              */
  __IO uint32_t CR;                /*!< Control Register                             */
  __IO uint32_t MOD0;              /*!< Mode Control Register 0                      */
  __IO uint32_t BRCR;              /*!< Baud Rate Generator Control Register         */
  __IO uint32_t BRADD;             /*!< Baud Rate Generator Control Register 2       */
  __IO uint32_t MOD1;              /*!< Mode Control Register 1                      */
  __IO uint32_t MOD2;              /*!< Mode Control Register 2                      */
  __IO uint32_t RFC;               /*!< RX FIFO Configuration Register               */
  __IO uint32_t TFC;               /*!< TX FIFO Configuration Register               */
  __I  uint32_t RST;               /*!< RX FIFO Status Register                      */
  __I  uint32_t TST;               /*!< TX FIFO Status Register                      */
  __IO uint32_t FCNF;              /*!< FIFO Configuration Register                  */
} TSB_SC_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< Mode Register                                */
  __O  uint32_t CR;                /*!< Control Register                             */
  __I  uint32_t FLG;               /*!< Flag Register                                */
} TSB_WD_TypeDef;

/**
  * @brief Clock Control (CG)
  */
typedef struct
{
  __IO uint32_t PROTECT;           /*!< Protect Register                             */
  __IO uint32_t OSCSEL;            /*!< High-speed oscillation select Register       */
  __I  uint32_t OSCSTF;            /*!< High-speed oscillation status Register       */
  __IO uint32_t CLKCR;             /*!< Clock Control Register                       */
       uint32_t RESERVED0[2];
  __IO uint32_t OSCEN;             /*!< Oscillation enable Register                  */
       uint32_t RESERVED1[2];
  __IO uint32_t WUHCR;             /*!< High-speed oscillation warm-up Control Register*/
} TSB_CG_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_SSP0_BASE              (PERI_BASE  + 0x0040000UL)
#define TSB_DMAA_BASE              (PERI_BASE  + 0x004C000UL)
#define TSB_TEMP_BASE              (PERI_BASE  + 0x005D000UL)
#define TSB_DSADA_BASE             (PERI_BASE  + 0x0067000UL)
#define TSB_DSADB_BASE             (PERI_BASE  + 0x0067400UL)
#define TSB_DSADC_BASE             (PERI_BASE  + 0x0067800UL)
#define TSB_DSADD_BASE             (PERI_BASE  + 0x0067C00UL)
#define TSB_T16A0_BASE             (PERI_BASE  + 0x008D000UL)
#define TSB_INT0_BASE              (PERI_BASE  + 0x00B8000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00C0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00C0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00C0200UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00C0300UL)
#define TSB_TB0_BASE               (PERI_BASE  + 0x00C4000UL)
#define TSB_TB1_BASE               (PERI_BASE  + 0x00C4100UL)
#define TSB_TB2_BASE               (PERI_BASE  + 0x00C4200UL)
#define TSB_TB3_BASE               (PERI_BASE  + 0x00C4300UL)
#define TSB_SC0_BASE               (PERI_BASE  + 0x00E1000UL)
#define TSB_WD0_BASE               (PERI_BASE  + 0x00F2000UL)
#define TSB_CG0_BASE               (PERI_BASE  + 0x00F3000UL)


