iarsystems/ewarm-toshiba-example-projects/TMPM311/CMSIS/Device/Toshiba/TMPM310/Include/TMPM311.h
/* Peripheral declaration */
#define TSB_SSP0                   ((    TSB_SSP_TypeDef *)  TSB_SSP0_BASE)
#define TSB_DMAA                   ((    TSB_DMA_TypeDef *)  TSB_DMAA_BASE)
#define TSB_TEMP                   ((   TSB_TEMP_TypeDef *)  TSB_TEMP_BASE)
#define TSB_DSADA                  ((   TSB_DSAD_TypeDef *) TSB_DSADA_BASE)
#define TSB_DSADB                  ((   TSB_DSAD_TypeDef *) TSB_DSADB_BASE)
#define TSB_DSADC                  ((   TSB_DSAD_TypeDef *) TSB_DSADC_BASE)
#define TSB_DSADD                  ((   TSB_DSAD_TypeDef *) TSB_DSADD_BASE)
#define TSB_T16A0                  ((   TSB_T16A_TypeDef *) TSB_T16A0_BASE)
#define TSB_INT0                   ((    TSB_INT_TypeDef *)  TSB_INT0_BASE)
#define TSB_PA                     ((     TSB_PA_TypeDef *)    TSB_PA_BASE)
#define TSB_PB                     ((     TSB_PB_TypeDef *)    TSB_PB_BASE)
#define TSB_PC                     ((     TSB_PC_TypeDef *)    TSB_PC_BASE)
#define TSB_PD                     ((     TSB_PD_TypeDef *)    TSB_PD_BASE)
#define TSB_TB0                    ((     TSB_TB_TypeDef *)   TSB_TB0_BASE)
#define TSB_TB1                    ((     TSB_TB_TypeDef *)   TSB_TB1_BASE)
#define TSB_TB2                    ((     TSB_TB_TypeDef *)   TSB_TB2_BASE)
#define TSB_TB3                    ((     TSB_TB_TypeDef *)   TSB_TB3_BASE)
#define TSB_SC0                    ((     TSB_SC_TypeDef *)   TSB_SC0_BASE)
#define TSB_WD0                    ((     TSB_WD_TypeDef *)   TSB_WD0_BASE)
#define TSB_CG0                    ((     TSB_CG_TypeDef *)   TSB_CG0_BASE)


/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))



/* Synchronous Serial Port (SSP) */
#define TSB_SSP0_CR0_SPO                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR0,6)))
#define TSB_SSP0_CR0_SPH                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR0,7)))
#define TSB_SSP0_CR1_LBM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,0)))
#define TSB_SSP0_CR1_SSE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,1)))
#define TSB_SSP0_CR1_MS                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,2)))
#define TSB_SSP0_CR1_SOD                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,3)))
#define TSB_SSP0_SR_TFE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,0)))
#define TSB_SSP0_SR_TNF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,1)))
#define TSB_SSP0_SR_RNE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,2)))
#define TSB_SSP0_SR_RFF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,3)))
#define TSB_SSP0_SR_BSY                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,4)))
#define TSB_SSP0_IMSC_RORIM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,0)))
#define TSB_SSP0_IMSC_RTIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,1)))
#define TSB_SSP0_IMSC_RXIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,2)))
#define TSB_SSP0_IMSC_TXIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,3)))
#define TSB_SSP0_RIS_RORRIS                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,0)))
#define TSB_SSP0_RIS_RTRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,1)))
#define TSB_SSP0_RIS_RXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,2)))
#define TSB_SSP0_RIS_TXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,3)))
#define TSB_SSP0_MIS_RORMIS                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,0)))
#define TSB_SSP0_MIS_RTMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,1)))
#define TSB_SSP0_MIS_RXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,2)))
#define TSB_SSP0_MIS_TXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,3)))
#define TSB_SSP0_ICR_RORIC                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_SSP0->ICR,0)))
#define TSB_SSP0_ICR_RTIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_SSP0->ICR,1)))


/* DMA Controller (DMA) */
#define TSB_DMAA_STATUS_MASTER_ENABLE             (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAA->STATUS,0)))
#define TSB_DMAA_CFG_MASTER_ENABLE                (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMAA->CFG,0)))
#define TSB_DMAA_ERRCLR_ERR_CLR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAA->ERRCLR,0)))


/* Temperature Sensor (TEMP) */
#define TSB_TEMP_EN_EN0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TEMP->EN,0)))
#define TSB_TEMP_EN_EN1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TEMP->EN,1)))
#define TSB_TEMP_CR_CR0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TEMP->CR,0)))


/* 24bit Delta Sigma AD Converter (DSAD) */
#define TSB_DSADA_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR1,0)))
#define TSB_DSADA_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR1,1)))
#define TSB_DSADA_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSADA->CR2,0)))
#define TSB_DSADA_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR3,0)))
#define TSB_DSADA_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR3,8)))
#define TSB_DSADA_CR3_DSADHTG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR3,12)))
#define TSB_DSADA_CR3_DSADHS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR3,13)))
#define TSB_DSADA_CR5_DSADCH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->CR5,0)))
#define TSB_DSADA_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADA->ADJ,0)))
#define TSB_DSADA_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADA->ST,0)))
#define TSB_DSADA_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADA->ST,1)))
#define TSB_DSADA_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADA->RES,0)))
#define TSB_DSADA_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADA->RES,1)))

#define TSB_DSADB_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR1,0)))
#define TSB_DSADB_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR1,1)))
#define TSB_DSADB_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSADB->CR2,0)))
#define TSB_DSADB_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR3,0)))
#define TSB_DSADB_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR3,8)))
#define TSB_DSADB_CR3_DSADHTG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR3,12)))
#define TSB_DSADB_CR3_DSADHS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR3,13)))
#define TSB_DSADB_CR5_DSADCH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->CR5,0)))
#define TSB_DSADB_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADB->ADJ,0)))
#define TSB_DSADB_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADB->ST,0)))
#define TSB_DSADB_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADB->ST,1)))
#define TSB_DSADB_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADB->RES,0)))
#define TSB_DSADB_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADB->RES,1)))

#define TSB_DSADC_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR1,0)))
#define TSB_DSADC_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR1,1)))
#define TSB_DSADC_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSADC->CR2,0)))
#define TSB_DSADC_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR3,0)))
#define TSB_DSADC_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR3,8)))
#define TSB_DSADC_CR3_DSADHTG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR3,12)))
#define TSB_DSADC_CR3_DSADHS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR3,13)))
#define TSB_DSADC_CR5_DSADCH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->CR5,0)))
#define TSB_DSADC_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADC->ADJ,0)))
#define TSB_DSADC_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADC->ST,0)))
#define TSB_DSADC_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADC->ST,1)))
#define TSB_DSADC_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADC->RES,0)))
#define TSB_DSADC_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADC->RES,1)))

#define TSB_DSADD_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR1,0)))
#define TSB_DSADD_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR1,1)))
#define TSB_DSADD_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSADD->CR2,0)))
#define TSB_DSADD_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR3,0)))
#define TSB_DSADD_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR3,8)))
#define TSB_DSADD_CR3_DSADHTG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR3,12)))
#define TSB_DSADD_CR3_DSADHS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR3,13)))
#define TSB_DSADD_CR5_DSADCH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->CR5,0)))
#define TSB_DSADD_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSADD->ADJ,0)))
#define TSB_DSADD_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADD->ST,0)))
#define TSB_DSADD_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADD->ST,1)))
#define TSB_DSADD_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADD->RES,0)))
#define TSB_DSADD_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSADD->RES,1)))


/* 16-bit TimerA (T16A) */
#define TSB_T16A0_EN_HALT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->EN,1)))
#define TSB_T16A0_RUN_RUN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->RUN,0)))
#define TSB_T16A0_CR_CLK                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->CR,0)))


